Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The HTTP request authentication fails, and the requester receives a challenge specific to the authentication mechanism, for example, a `401` error, a URL redirect to reauthenticate, or some other custom authentication challenge response. For practical examples of challenge responses, see the Quarkus xref:security-customization.adoc[Security Tips and Tricks] guide.
ja_jp: HTTP リクエストの認証に失敗すると、リクエスト元は認証メカニズム固有のチャレンジ（ `401` エラー、再認証のための URL リダイレクト、その他のカスタム認証チャレンジレスポンスなど）を受け取ります。 チャレンジレスポンスの実用的な例については、Quarkus xref:security-customization.adoc[Security Tips and Tricks] ガイドを参照してください。

source: The HTTP request authorization fails and the requester gets denied access to the Quarkus application.
ja_jp: HTTPリクエストの認可が失敗し、Quarkusアプリケーションへのアクセスが拒否されます。

source: The HTTP request authorization fails, and the requester gets denied access to the Quarkus application.
ja_jp: HTTPリクエストの認可に失敗すると、Quarkusアプリケーションへのアクセスが拒否されます。

source: The HTTP request gets authenticated and authorized and access to the Quarkus application gets granted.
ja_jp: HTTPリクエストは認証、認可され、Quarkusアプリケーションへのアクセスが許可されます。

source: The HTTP request gets authenticated and authorized, and access to the Quarkus application gets granted.
ja_jp: HTTPリクエストの認証と認可が行われ、Quarkusアプリケーションへのアクセスが許可されます。

source: The Hello function is a simple function returning “Hello” and using the Quarkus AWS Lambda extension
ja_jp: Hello関数は、 "Hello" を返すシンプルな関数で、Quarkus AWS Lambdaエクステンションを使用しています。

source: The Hero service is a fully reactive and non-blocking HTTP microservice exposing CRUD operations on a `+Hero+` data model. The REST layer is implemented using https://quarkus.io/guides/resteasy-reactive[RESTEasy Reactive^] with reactive endpoints. Data is persisted into a https://www.postgresql.org[PostgreSQL^] database using the https://quarkus.io/guides/hibernate-reactive-panache#solution-2-using-the-repository-pattern[repository pattern^] from https://quarkus.io/guides/hibernate-reactive-panache[Quarkus Hibernate Reactive with Panache^]. Additionally, the Hero service favors https://quarkus.io/guides/cdi-reference#simplified-constructor-injection[constructor injection^] of beans over https://quarkus.io/guides/cdi-reference#qualified-injected-fields[field injection^]. The Hero service contains a full suite of unit and integration tests, using https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[mocking^], https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[spying^], and testing within https://quarkus.io/guides/hibernate-reactive-panache#transactions[isolated transactions^].
ja_jp: Heroサービスは、完全にリアクティブでノンブロッキングなHTTPマイクロサービスで、 `Hero` データモデルに対するCRUD操作を公開しています。REST層は、 link:https://quarkus.io/guides/resteasy-reactive[RESTEasy Reactive, window=_blank]を使用してリアクティブなエンドポイントを実装しています。データは、 link:https://quarkus.io/guides/hibernate-reactive-panache[Quarkus Hibernate Reactive with Panache, window=_blank]の link:https://quarkus.io/guides/hibernate-reactive-panache#solution-2-using-the-repository-pattern[リポジトリパターン, window=_blank]を使用して link:https://www.postgresql.org[PostgreSQL, window=_blank]データベースに永続化されます。さらに、Heroサービスは、 link:https://quarkus.io/guides/cdi-reference#qualified-injected-fields[フィールドインジェクション, window=_blank]よりもビーンの link:https://quarkus.io/guides/cdi-reference#simplified-constructor-injection[コンストラクタインジェクション, window=_blank]を優先します。Heroサービスには、ユニットテストと統合テストの完全なスイートが含まれており、 link:https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[モッキング, window=_blank]、 link:https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[スパイ, window=_blank]、 link:https://quarkus.io/guides/hibernate-reactive-panache#transactions[隔離された, window=_blank]トランザクション内でのテストを使用しています。

source: The Heroes function implements a CRUD interface on top of DynamoDB. It uses the Quarkus AWS Lamdba HTTP and RESTEasy Reactive. Invocations go through an AWS API Gateway.
ja_jp: Heroes関数は、DynamoDBの上にCRUDインターフェイスを実装しています。QuarkusのAWS Lamdba HTTPとRESTEasy Reactiveを使用しています。呼び出しは、AWS API Gatewayを経由します。

source: The Hibernate ORM Quarkus extension sets some default configurations differently in dev and test modes than in other environments.
ja_jp: Hibernate ORM Quarkusエクステンションでは、いくつかのデフォルト設定が、開発モードとテストモードで他の環境とは異なるように設定されています。

source: The Hibernate ORM extension supports defining xref:hibernate-orm.adoc#multiple-persistence-units[persistence units] by using configuration properties. For each persistence unit, point to the datasource of your choice.
ja_jp: Hibernate ORM エクステンションは、設定プロパティーを使用した xref:hibernate-orm.adoc#multiple-persistence-units[永続化ユニット] の定義をサポートしています。 各固有化ユニットに対して、任意のデータソースを指定します。

source: The Hibernate ORM extension will only create this table for you when the database schema is generated. For more information, refer to the xref:hibernate-orm.adoc[Hibernate ORM] guide.
ja_jp: Hibernate ORM エクステンションは、データベーススキーマが生成された場合にのみ、このテーブルを作成します。 詳細は、xref:hibernate-orm.adoc[Hibernate ORM] ガイドを参照してください。

source: The Hibernate ORM extension xref:hibernate-orm.adoc#multiple-persistence-units[supports defining several persistence units using configuration properties]. For each persistence unit, you can point to the datasource of your choice.
ja_jp: Hibernate ORMエクステンションは、 link:hibernate-orm.html#multiple-persistence-units[設定プロパティを使用して複数の永続化ユニットを定義することをサポートしています]。各永続化ユニットでは、選択したデータソースを指定することができます。

source: The Hibernate ORM release announcements have a lot of information about the changes/improvements in Hibernate ORM 6:
ja_jp: Hibernate ORMのリリースアナウンスには、Hibernate ORM 6の変更点/改善点に関する情報が多く掲載されています：

source: The Hibernate Search DSL supports a significant subset of the Elasticsearch predicates (match, range, nested, phrase, spatial...). Feel free to explore the DSL using autocompletion.
ja_jp: Hibernate Search DSLはElasticsearchの述語（match、range、nested、phrase、spatial...）の重要なサブセットをサポートしています。オートコンプリートを使ってDSLをご自由にお試しください。

source: The Hibernate Search Standalone extension cannot be used in the same application as the xref:hibernate-search-orm-elasticsearch.adoc[Hibernate Search extension with Hibernate ORM]
ja_jp: Hibernate Search Standalone エクステンションは、 xref:hibernate-search-orm-elasticsearch.adoc[Hibernate ORM を使用した Hibernate Search エクステンション] と同じアプリケーションでは使用できません。

source: The Hibernate Search extension now uses Hibernate Search 6.1:
ja_jp: Hibernate Searchエクステンションは、Hibernate Search 6.1を使用するようになりました。

source: The Hibernate Search extension provides an HTTP endpoint to reindex your data through the xref:./management-interface-reference.adoc[management interface]. By default, this endpoint is not available. It can be enabled through configuration properties as shown below.
ja_jp: Hibernate Search エクステンションは、xref:./management-interface-reference.adoc[管理インターフェイス] を通じてデータを再インデックスするための HTTP エンドポイントを提供します。 デフォルトでは、このエンドポイントは使用できません。以下に示すように、設定プロパティーを通じて有効にできます。

source: The Hibernate Validator extension is tightly integrated with CDI.
ja_jp: Hibernate ValidatorエクステンションはCDIと緊密に統合されています。

source: The Homebrew package manager on Mac (*brew*) *should not be used to install Podman* as it results in an unverified combination of components. This is due to Homebrew sharing dependencies between projects, along with limited vetting of upgrade requests. As an example, there were several instances where an update to qemu broke on Apple Silicon, preventing Podman machine VMs from booting.
ja_jp: MacのHomebrewパッケージマネージャ (*brew*) を *使ってPodmanをインストールしてはいけません* 。これは、Homebrew がプロジェクト間で依存関係を共有していることと、アップグレード要求の審査が限られていることが原因です。例として、qemu へのアップデートが Apple Silicon 上で壊れ、Podman マシンの VM が起動できなくなることがいくつかありました。

source: The HttpFunction
ja_jp: HttpFunction

source: The ID token is always a JWT and represents user authentication with the JWT claims. You can use this to get the issuing OIDC endpoint, the username, and other information called _claims_. You can access ID token claims by injecting `JsonWebToken` with an `IdToken` qualifier:
ja_jp: ID トークンは常に JWT であり、JWT クレームによるユーザー認証を表します。 これを使って発行元の OIDC エンドポイント、ユーザー名、その他 _クレーム_ と呼ばれる情報を取得することができます。 `JsonWebToken` に `IdToken` という修飾子をつけることで、ID トークンのクレームにアクセスすることができます。

source: The ID token is always a JWT token and represents a user authentication with the JWT claims. You can use this to get the issuing OIDC endpoint, the username, and other information called _claims_. You can access ID token claims by injecting `JsonWebToken` with an `IdToken` qualifier:
ja_jp: IDトークンは常にJWTトークンであり、JWTクレームによるユーザー認証を表します。 これを使って発行元のOIDCエンドポイントやユーザー名、その他 _クレーム_ と呼ばれる情報を取得することができます。 `JsonWebToken` に `IdToken` という修飾子をつけることで、IDトークンのクレームにアクセスすることができます：

source: The Infinispan Client extension enables SSL/TLS by default. You can read more about this at xref:native-and-ssl.adoc[Using SSL With Native Executables].
ja_jp: Infinispanクライアント拡張は、デフォルトでSSL/TLSを有効にします。これについては xref:native-and-ssl.adoc[Using SSL With Native Executables] に詳しく書かれています。

source: The Infinispan Client extension offers a set of annotations that can be used in a CDI managed bean to enable caching abilities with Infinispan.
ja_jp: Infinispan Client エクステンションは、Infinispan でのキャッシュ能力を有効にするために CDI 管理 Bean で使用できるアノテーションのセットを提供します。

source: The Infinispan Client extension supports connecting to more than one Infinispan Cluster with the named connections. If you need to spin an additional Dev Service for a connection name, configure at least on property in the application properties:
ja_jp: Infinispan クライアントエクステンションは、名前付き接続で複数の Infinispan クラスタへの接続をサポートします。接続名に対して追加の Dev Service を起動する必要がある場合は、アプリケーションのプロパティで少なくとも 1 つのプロパティを設定してください：

source: The Infinispan Client extension supports connecting to more than one Infinispan Cluster with the named connections. If you need to spin an additional dev service for a connection name, configure at least on property in the application properties:
ja_jp: Infinispan Clientエクステンションは、名前付き接続で複数のInfinispanクラスタへの接続をサポートしています。接続名に対して追加のdevサービスを起動する必要がある場合は、アプリケーションのプロパティで少なくとも1つのプロパティを設定してください：

source: The Infinispan Client has additional features that were not mentioned here. This means this feature was not tested in a Quarkus environment and they may or may not work. Please let us know if you need these added!
ja_jp: Infinispanクライアントには、ここでは触れられていない追加機能があります。これは、この機能がQuarkus環境でテストされていないことを意味し、それらは動作するかもしれないし、動作しないかもしれません。これらの機能を追加する必要がある場合は、ご連絡ください。

source: The Infinispan Client has additional features that were not mentioned here. This means this feature was not tested in a Quarkus environment, and they may or may not work. Please let us know if you need these added!
ja_jp: Infinispanクライアントには、ここに記載されていない追加機能があります。これは、この機能がQuarkus環境でテストされていないことを意味し、それらは動作するかもしれませんし、動作しないかもしれません。これらの追加機能が必要な場合は、ぜひお知らせください。

source: The Infinispan Dev Service will be enabled when the `quarkus-infinispan-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found at the xref:infinispan-client.adoc#dev-services[Infinispan Guide].
ja_jp: Infinispan Dev Serviceは、アプリケーションに `quarkus-infinispan-client` エクステンションが存在し、サーバ・アドレスが明示的に設定されていない場合に有効になります。詳細は link:infinispan-client.html#dev-services[Infinispanガイド]に記載されています。

source: The Infinispan Dev Service will be enabled when the `quarkus-infinispan-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:infinispan-client.adoc#dev-services[Infinispan Guide].
ja_jp: Infinispan Dev Serviceは、アプリケーションに `quarkus-infinispan-client` エクステンションが存在し、サーバ・アドレスが明示的に設定されていない場合に有効になります。詳細は link:infinispan-client.html#dev-services[Infinispanガイド]を参照してください。

source: The Infinispan Dev Service will be enabled when the `quarkus-infinispan-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:infinispan-dev-services.adoc[Infinispan Dev Services Guide].
ja_jp: Infinispan Dev Serviceは、アプリケーションに `quarkus-infinispan-client` エクステンションが存在し、サーバ・アドレスが明示的に設定されていない場合に有効になります。詳細は xref:infinispan-dev-services.adoc[Infinispan Dev Services ガイド] を参照してください。

source: The Infinispan backend uses the `<default>` Infinispan client. Refer to the xref:infinispan-client-reference.adoc[Infinispan reference] for configuring the access to Infinispan.
ja_jp: Infinispan バックエンドは `<default>` Infinispan クライアントを使用します。 Infinispan へのアクセスを設定するには、xref:infinispan-client-reference.adoc[Infinispan リファレンス] を参照してください。

source: The Infinispan client extension has been upgraded to 13.0.0.Final.
ja_jp: Infinispan クライアントエクステンションが 13.0.0.Final にアップグレードされました。

source: The Infinispan client supports both indexed and non-indexed querying as long as the `ProtoStreamMarshaller` is configured above. This allows the user to query based on the properties of the proto schema.
ja_jp: Infinispan クライアントは、上記の `ProtoStreamMarshaller` が設定されている限り、インデックス付きと非インデックス付きの両方の問い合せをサポートしています。これにより、ユーザはプロトスキーマのプロパティに基づいて問い合せできます。

source: The Infinispan client supports both indexed and non-indexed search as long as the `ProtoStreamMarshaller` is configured above. This allows the user to query based on the properties of the proto schema. *Indexed queries are preferred for performance reasons*.
ja_jp: Infinispan クライアントは、上記の `ProtoStreamMarshaller` が設定されている限り、インデックス付と非インデックス付の両方の検索をサポートしています。これにより、ユーザはプロトスキーマのプロパティに基づいてクエリできます。*パフォーマンス上の理由から、インデックス付クエリが望ましいです* 。

source: The Infinispan client supports both indexed and non-indexed search as long as the `ProtoStreamMarshaller` is configured above. This allows the user to query on *keys* or *values* based on the properties of the proto schema. *Indexed queries are preferred for performance reasons*.
ja_jp: Infinispan クライアントは、 `ProtoStreamMarshaller` が上記のように設定されている限り、インデックス付き検索とインデックスなし検索の両方をサポートします。これにより、ユーザはプロトスキーマのプロパティに基づく *キー* または *値に対して* クエリを実行できます。 *パフォーマンス上の理由から、インデックス付きクエリが推奨されます* 。

source: The Interceptors specification is clear that _around-invoke_ methods must not be declared static. However, this restriction was driven mostly by technical limitations. And since Quarkus is a build-time oriented stack that allows for additional class transformations, those limitations don't apply anymore. It's possible to annotate a non-private static method with an interceptor binding:
ja_jp: インターセプターの仕様は、_around-invoke_ メソッドを静的宣言してはならないことは明らかです。しかし、この制限は、主に技術的な制限によって設定されました。Quarkus は追加のクラス変換を可能にするビルド時指向のスタックであるため、この制限は適用されなくなりました。インターセプタ―バインディングで非プライベートの静的メソッドにアノテーションを付けることができます。

source: The JAX-RS endpoint
ja_jp: JAX-RS エンドポイント

source: The JAX-RS resource can also be substituted with a Spring Web controller as Quarkus supports REST endpoint definition using Spring controllers. See the xref:spring-web.adoc[Spring Web guide] for more details.
ja_jp: Quarkus は Spring コントローラーを使用した REST エンドポイント定義をサポートしているため、JAX-RS リソースを Spring Web コントローラーに置き換えることもできます。詳細については、xref:spring-web.adoc[Spring Web ガイド] を参照してください。

source: The JAX-RS resources
ja_jp: JAX-RSリソース

source: The JAX-RS way
ja_jp: JAX-RS の方法

source: The JAXB Quarkus REST extension will automatically detect the classes that are used in the resources and require JAXB serialization. Then, it will register these classes into the default `JAXBContext` which is internally used by the JAXB message reader and writer.
ja_jp: JAXB Quarkus REST エクステンションは、リソースで使用され、JAXB シリアル化を必要とするクラスを自動的に検出します。次に、これらのクラスを、JAXB メッセージリーダーとライターによって内部的に使用されるデフォルトの `JAXBContext` に登録します。

source: The JAXB Quarkus REST extension will serialize and unserialize requests and responses transparently for users. However, if you need finer grain control over JAXB components, you can inject either the JAXBContext, Marshaller, or Unmarshaller components into your beans:
ja_jp: JAXB Quarkus REST エクステンションは、ユーザーに対して透過的にリクエストとレスポンスをシリアライズおよびアンシリアライズします。ただし、JAXB コンポーネントをより細かく制御する必要がある場合は、JAXBContext、Marshaller、または Unmarshaller コンポーネントのいずれかを Bean に注入できます。

source: The JAXB Resteasy Reactive extension will automatically detect the classes that are used in the resources and require JAXB serialization. Then, it will register these classes into the default `JAXBContext` which is internally used by the JAXB message reader and writer.
ja_jp: JAXB RESTEasy Reactiveエクステンションは、リソースで使用され、JAXBシリアライゼーションを必要とするクラスを自動的に検出します。そして、これらのクラスを、JAXBメッセージリーダーとライターが内部で使用するデフォルトの `JAXBContext` に登録します。

source: The JAXB context can also be customized through `JaxbContextCustomizer` beans.
ja_jp: JAXBコンテキストは、 `JaxbContextCustomizer` Beanを通じてカスタマイズすることも可能です。

source: The JAXB resteasy reactive extension will serialize and unserialize requests and responses transparently for users. However, if you need finer grain control over JAXB components, you can inject either the JAXBContext, Marshaller, or Unmarshaller components into your beans:
ja_jp: JAXB resteasy リアクティブエクステンションは、ユーザーに対して透過的にリクエストとレスポンスをシリアライズおよびアンシリアライズします。ただし、JAXB コンポーネントをより細かく制御する必要がある場合は、JAXBContext、Marshaller、または Unmarshaller コンポーネントのいずれかを Bean に注入できます。

source: The JBeret Quarkus extension supports the following configuration:
ja_jp: JBeret Quarkus エクステンションは、以下の設定をサポートしています。

source: The JBeret REST API, provides REST resources to several operations around the Batch API: starting and stopping jobs, querying the status of a job, schedule a job, and many more. The extension includes a REST client to simplify the REST API calls:
ja_jp: JBeret REST API は、Batch API に関連するいくつかの操作のための REST リソースを提供します。ジョブの開始と停止、ジョブのステータス照会、ジョブのスケジュール設定など、多くの操作があります。このエクステンションには、REST API 呼び出しを簡素化するための REST クライアントが含まれています。

source: The JBeret REST is integrated as separate extension that can be easily added to the target project with the following dependency:
ja_jp: JBeret REST は別のエクステンションとして統合されており、以下の依存関係で対象プロジェクトに簡単に追加できます。

source: The JBeret Scheduler is integrated out of the box in this extension.
ja_jp: JBeret スケジューラーは、このエクステンションにすぐに統合されています。

source: The JDBC URL should not include the hostname / IP of the database.
ja_jp: JDBCのURLには、データベースのホスト名/IPを含めないようにしてください。

source: The JDBC driver of PostgreSQL is defined as an optional dependency
ja_jp: PostgreSQLのJDBCドライバは、オプションの依存関係として定義されています。

source: The JDBC problem
ja_jp: postgresqlのJDBCの問題

source: The JDK version must be **exactly** the same
ja_jp: JDK バージョンは **完全に** 同じである必要があります

source: The JNDI technology is commonly used in other runtimes to integrate different components. A common use case is Java Enterprise servers to bind the TransactionManager and the Datasource components to a name and then have Hibernate ORM configured to look these components up by name. But in Quarkus, this use case doesn't apply as components are injected directly, making JNDI support an unnecessary legacy. To avoid unexpected use of JNDI, full support for JNDI has been disabled in the Hibernate ORM extension for Quarkus. This is both a security precaution and an optimization.
ja_jp: JNDI技術は、異なるコンポーネントを統合するために他のランタイムで一般的に使用されています。一般的な使用例は、Java EnterpriseサーバーでTransactionManagerとDatasourceコンポーネントを名前にバインドし、Hibernate ORMがこれらのコンポーネントを名前で検索するように設定することです。しかし、Quarkusでは、コンポーネントが直接注入されるため、このユースケースは適用されず、JNDIサポートは不要なレガシーとなります。JNDIの予期せぬ使用を避けるため、QuarkusのHibernate ORMエクステンションでは、JNDIの完全なサポートは無効になっています。これは、セキュリティ上の予防策であり、最適化でもあります。

source: The JNDI technology is commonly used in other runtimes to integrate different components. A common use case is Java Enterprise servers to bind the TransactionManager and the Datasource components to a name, and then have Hibernate ORM configured to look these components up by name. But in Quarkus this use case doesn't apply as components are injected directly, making JNDI support an unnecessary legacy. As a precaution, to avoid unexpected use of JNDI, the whole support for JNDI has been disabled in the Hibernate ORM extension for Quarkus. This is both a security precaution and an optimisation.
ja_jp: JNDI技術は、異なるコンポーネントを統合するために他のランタイムで一般的に使用されています。一般的な使用例は、Java Enterpriseサーバーで、TransactionManagerとDatasourceコンポーネントを名前にバインドし、Hibernate ORMがこれらのコンポーネントを名前で検索するように設定することです。しかし、Quarkusでは、コンポーネントが直接インジェクションされるため、このユースケースは適用されず、JNDIサポートは不要なレガシーとなります。JNDIの予期せぬ使用を避けるため、QuarkusのHibernate ORMエクステンションでは、JNDIのサポートはすべて無効化されています。これはセキュリティ上の予防策であり、最適化でもあります。

source: The JPA `IdentityProvider` creates a `SecurityIdentity` instance, which is used during user authentication to verify and authorize access requests making your Quarkus application secure.
ja_jp: JPA `IdentityProvider` は、 `SecurityIdentity` インスタンスを作成します。このインスタンスは、ユーザー認証時に使用され、アクセス要求の確認と認可を行い、Quarkus アプリケーションを保護します。

source: The JReleaser tool can be invoked in many ways: as a CLI tool, as a Docker image, or as a Maven plugin. The last option is very convenient given that we are already working with Maven. Let's add yet another profile that contains the release configuration as once again we don't require this behavior to be active all the time only when we're ready to post a release:
ja_jp: JReleaser ツールは、CLI ツール、Docker イメージ、または Maven プラグインなどのさまざまな方法で呼び出すことができます。最後のオプションは、すでに Maven を使用していることを考えると、非常に便利です。リリース設定を含むさらに別のプロファイルを追加しましょう。リリースを投稿する準備ができている場合にのみ、この動作を常にアクティブにする必要はありません。

source: The JSON logging extension can be configured in various ways. The following properties are supported:
ja_jp: JSON ロギングエクステンションは、さまざまな方法で設定することができます。以下のプロパティーがサポートされています。

source: The JSON-B extension will then use the produced build item to register your serializer/deserializer automatically.
ja_jp: 次に、JSON-B エクステンションは、生成されたビルドアイテムを使用して、シリアライザー/デシリアライザーを自動的に登録します。

source: The JTA transaction context
ja_jp: JTAトランザクションコンテキスト

source: The JVM also has to cope with changes to the class base or execution profiles that result in a thread going down a previously cold path. At that point the JVM has to jump out of the compiled code into the interpreter and recompile the code to cater for a new execution profile that includes the previously cold path. That requires keeping runtime info that allow a compiled stack frame to be replaced with one or more interpreter frames. It also requires runtime extensible profile counters to be allocated and updated to track what has or has not been executed.
ja_jp: また、JVMはクラスベースや実行プロファイルの変更にも対応しなければならず、その結果、スレッドが以前のコールドパスを通ることになります。その時点で、JVMはコンパイルされたコードからインタープリタにジャンプし、以前のコールドパスを含む新しい実行プロファイルに対応するためにコードを再コンパイルしなければなりません。そのためには、コンパイルされたスタックフレームを1つまたは複数のインタープリタフレームに置き換えることができる実行時情報を保持する必要があります。また、実行されたもの、されなかったものを追跡するために、ランタイムの拡張可能なプロファイルカウンタを割り当て、更新する必要があります。

source: The JVM and HTTP server metrics are collected by Micrometer.
ja_jp: JVM および HTTP サーバーのメトリクスは Micrometer によって収集されます。

source: The JVM captures profiling data during the entire test execution.
ja_jp: JVM はテスト実行全体を通してプロファイリングデータをキャプチャーします。

source: The JVM captures profiling data during the test run
ja_jp: JVM がテスト実行中にプロファイリングデータを取得する

source: The JVM ecosystem ensures consistency, portability, and performance across deployments.
ja_jp: JVMエコシステムは、デプロイメント全体で一貫性、ポータビリティ、およびパフォーマンスを保証します。

source: The JVM is resilient. Faced with a situation where the archive file is not usable (for whatever reason) it will simply disable the AppCDS feature.
ja_jp: JVMは弾力的です。アーカイブ・ファイルが（何らかの理由で）使用できない状況に直面すると、単にAppCDS機能を無効にします。

source: The JVM settings of the processes performing the code generation and/or Quarkus build can be configured as follows. See link:https://docs.gradle.org/current/javadoc/org/gradle/process/JavaForkOptions.html[JavaForkOptions] for details.
ja_jp: コード生成やQuarkusビルドを実行するプロセスのJVM設定は、次のように設定できます。詳細については、 link:https://docs.gradle.org/current/javadoc/org/gradle/process/JavaForkOptions.html[JavaForkOptions] を参照してください。

source: The JWT string is a Base64 URL-encoded string consisting of three parts, separated by `.` characters:
ja_jp: JWT 文字列は、 `.` 文字で区切られた 3 つの部分が含まれる Base64 URL エンコードされた文字列です。
